# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

* 1) Creating DataFrames
* 2) Selecting, Creating and Dropping Columns
* 3) Selecting, Creating and Dropping Rows 
* 4) Selecting subset of rows and columns
* 5) Selecting by conditions

In [1]:
import pandas as pd
import numpy as np

np.random.seed(101)

## 1) Creating DataFrames

### Using Numpy Array

In [2]:
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [3]:
df = pd.DataFrame(np.random.randn(5,4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])

In [4]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Using Dictionary

In [5]:
df2 = pd.DataFrame({'A':[1,2,3],
                  'B':[5,6,7],
                  'C':[1,2,3],
                  'D': [10, 20, 30]}, index=['X', 'Y', 'Z'])

In [6]:
df2

   A  B  C   D
X  1  5  1  10
Y  2  6  2  20
Z  3  7  3  30

## 2) Selecting, Creating and Dropping Columns

### Selecting Columns

In [7]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [8]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [9]:
df['X']

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [10]:
# Pass a list of column names
df[['Z','W']]

          Z         W
A -1.159119  0.302665
B  0.184502 -0.134841
C  0.329646  0.807706
D  0.484752 -0.497104
E  1.996652 -0.116773

DataFrame Columns are just Series

In [11]:
type(df['W'])

pandas.core.series.Series

### Creating a New Column

In [12]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [13]:
df['my_list'] = [20, 50, 80, 90, 70]

In [14]:
df

          W         X         Y         Z  my_list
A  0.302665  1.693723 -1.706086 -1.159119       20
B -0.134841  0.390528  0.166905  0.184502       50
C  0.807706  0.072960  0.638787  0.329646       80
D -0.497104 -0.754070 -0.943406  0.484752       90
E -0.116773  1.901755  0.238127  1.996652       70

In [15]:
df['my_np_array'] = np.array([200, 500, 800, 900, 700])

In [16]:
df

          W         X         Y         Z  my_list  my_np_array
A  0.302665  1.693723 -1.706086 -1.159119       20          200
B -0.134841  0.390528  0.166905  0.184502       50          500
C  0.807706  0.072960  0.638787  0.329646       80          800
D -0.497104 -0.754070 -0.943406  0.484752       90          900
E -0.116773  1.901755  0.238127  1.996652       70          700

In [17]:
df['my_ser'] = pd.Series([10,20,30,40,50], index=['B', 'A', 'E', 'D', 'C'])

In [18]:
df

          W         X         Y         Z  my_list  my_np_array  my_ser
A  0.302665  1.693723 -1.706086 -1.159119       20          200      20
B -0.134841  0.390528  0.166905  0.184502       50          500      10
C  0.807706  0.072960  0.638787  0.329646       80          800      50
D -0.497104 -0.754070 -0.943406  0.484752       90          900      40
E -0.116773  1.901755  0.238127  1.996652       70          700      30

In [19]:
df['new'] = df['W'] + df['Y']

In [20]:
df

,W,X,Y,Z,my_list,my_np_array,my_ser,new
A,0.302665,1.693723,-1.706086,-1.159119,20,200,20,-1.403420
B,-0.134841,0.390528,0.166905,0.184502,50,500,10,0.032064
C,0.807706,0.072960,0.638787,0.329646,80,800,50,1.446493
D,-0.497104,-0.754070,-0.943406,0.484752,90,900,40,-1.440510
E,-0.116773,1.901755,0.238127,1.996652,70,700,30,0.121354

In [21]:
df['plus_5'] = df['my_ser'] + 5
df

,W,X,Y,Z,my_list,my_np_array,my_ser,new,plus_5
A,0.302665,1.693723,-1.706086,-1.159119,20,200,20,-1.403420,25
B,-0.134841,0.390528,0.166905,0.184502,50,500,10,0.032064,15
C,0.807706,0.072960,0.638787,0.329646,80,800,50,1.446493,55
D,-0.497104,-0.754070,-0.943406,0.484752,90,900,40,-1.440510,45
E,-0.116773,1.901755,0.238127,1.996652,70,700,30,0.121354,35

In [22]:
df['gt_85'] = df['my_np_array'] > 600
df

,W,X,Y,Z,my_list,my_np_array,my_ser,new,plus_5,gt_85
A,0.302665,1.693723,-1.706086,-1.159119,20,200,20,-1.403420,25,False
B,-0.134841,0.390528,0.166905,0.184502,50,500,10,0.032064,15,False
C,0.807706,0.072960,0.638787,0.329646,80,800,50,1.446493,55,True
D,-0.497104,-0.754070,-0.943406,0.484752,90,900,40,-1.440510,45,True
E,-0.116773,1.901755,0.238127,1.996652,70,700,30,0.121354,35,True

### Droping Columns

In [23]:
df.drop('new', axis=1)

,W,X,Y,Z,my_list,my_np_array,my_ser,plus_5,gt_85
A,0.302665,1.693723,-1.706086,-1.159119,20,200,20,25,False
B,-0.134841,0.390528,0.166905,0.184502,50,500,10,15,False
C,0.807706,0.072960,0.638787,0.329646,80,800,50,55,True
D,-0.497104,-0.754070,-0.943406,0.484752,90,900,40,45,True
E,-0.116773,1.901755,0.238127,1.996652,70,700,30,35,True

In [24]:
# Not inplace unless specified!
df

,W,X,Y,Z,my_list,my_np_array,my_ser,new,plus_5,gt_85
A,0.302665,1.693723,-1.706086,-1.159119,20,200,20,-1.403420,25,False
B,-0.134841,0.390528,0.166905,0.184502,50,500,10,0.032064,15,False
C,0.807706,0.072960,0.638787,0.329646,80,800,50,1.446493,55,True
D,-0.497104,-0.754070,-0.943406,0.484752,90,900,40,-1.440510,45,True
E,-0.116773,1.901755,0.238127,1.996652,70,700,30,0.121354,35,True

In [25]:
df.drop('new', axis=1, inplace=True)

In [26]:
df

,W,X,Y,Z,my_list,my_np_array,my_ser,plus_5,gt_85
A,0.302665,1.693723,-1.706086,-1.159119,20,200,20,25,False
B,-0.134841,0.390528,0.166905,0.184502,50,500,10,15,False
C,0.807706,0.072960,0.638787,0.329646,80,800,50,55,True
D,-0.497104,-0.754070,-0.943406,0.484752,90,900,40,45,True
E,-0.116773,1.901755,0.238127,1.996652,70,700,30,35,True

In [27]:
df.drop(columns=['my_ser', 'my_np_array', 'gt_85', 'plus_5'], axis=1, inplace=True)

In [28]:
df

          W         X         Y         Z  my_list
A  0.302665  1.693723 -1.706086 -1.159119       20
B -0.134841  0.390528  0.166905  0.184502       50
C  0.807706  0.072960  0.638787  0.329646       80
D -0.497104 -0.754070 -0.943406  0.484752       90
E -0.116773  1.901755  0.238127  1.996652       70

## 3) Selecting, Creating and Dropping Rows

### Selecting Rows

In [29]:
df

          W         X         Y         Z  my_list
A  0.302665  1.693723 -1.706086 -1.159119       20
B -0.134841  0.390528  0.166905  0.184502       50
C  0.807706  0.072960  0.638787  0.329646       80
D -0.497104 -0.754070 -0.943406  0.484752       90
E -0.116773  1.901755  0.238127  1.996652       70

In [30]:
df.loc['A']

W           0.302665
X           1.693723
Y          -1.706086
Z          -1.159119
my_list    20.000000
Name: A, dtype: float64

In [31]:
df.loc['D']

W          -0.497104
X          -0.754070
Y          -0.943406
Z           0.484752
my_list    90.000000
Name: D, dtype: float64

Or select based off of position instead of label

In [32]:
df.iloc[3]

W          -0.497104
X          -0.754070
Y          -0.943406
Z           0.484752
my_list    90.000000
Name: D, dtype: float64

In [33]:
df.loc[['A', 'C']]

          W         X         Y         Z  my_list
A  0.302665  1.693723 -1.706086 -1.159119       20
C  0.807706  0.072960  0.638787  0.329646       80

In [34]:
df.iloc[[3, 4]]

          W         X         Y         Z  my_list
D -0.497104 -0.754070 -0.943406  0.484752       90
E -0.116773  1.901755  0.238127  1.996652       70

In [35]:
df.iloc[2:5]

          W         X         Y         Z  my_list
C  0.807706  0.072960  0.638787  0.329646       80
D -0.497104 -0.754070 -0.943406  0.484752       90
E -0.116773  1.901755  0.238127  1.996652       70

In [36]:
df.loc['A']

W           0.302665
X           1.693723
Y          -1.706086
Z          -1.159119
my_list    20.000000
Name: A, dtype: float64

In [37]:
df.loc['A']['W']

0.3026654485851825

In [38]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [39]:
df['W'].loc['A']

0.3026654485851825

In [40]:
df

          W         X         Y         Z  my_list
A  0.302665  1.693723 -1.706086 -1.159119       20
B -0.134841  0.390528  0.166905  0.184502       50
C  0.807706  0.072960  0.638787  0.329646       80
D -0.497104 -0.754070 -0.943406  0.484752       90
E -0.116773  1.901755  0.238127  1.996652       70

### Creating a New Row

In [41]:
df.loc['V'] = [10, 20, 50, 80, 90]

In [42]:
df

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119       20
B  -0.134841   0.390528   0.166905   0.184502       50
C   0.807706   0.072960   0.638787   0.329646       80
D  -0.497104  -0.754070  -0.943406   0.484752       90
E  -0.116773   1.901755   0.238127   1.996652       70
V  10.000000  20.000000  50.000000  80.000000       90

In [43]:
df.loc['H'] = df.loc['A'] + df.loc['B']

In [44]:
df

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119     20.0
B  -0.134841   0.390528   0.166905   0.184502     50.0
C   0.807706   0.072960   0.638787   0.329646     80.0
D  -0.497104  -0.754070  -0.943406   0.484752     90.0
E  -0.116773   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0
H   0.167825   2.084251  -1.539181  -0.974618     70.0

### Dropping Rows

In [45]:
df.drop('H', axis=0)

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119     20.0
B  -0.134841   0.390528   0.166905   0.184502     50.0
C   0.807706   0.072960   0.638787   0.329646     80.0
D  -0.497104  -0.754070  -0.943406   0.484752     90.0
E  -0.116773   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0

In [46]:
df

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119     20.0
B  -0.134841   0.390528   0.166905   0.184502     50.0
C   0.807706   0.072960   0.638787   0.329646     80.0
D  -0.497104  -0.754070  -0.943406   0.484752     90.0
E  -0.116773   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0
H   0.167825   2.084251  -1.539181  -0.974618     70.0

In [47]:
df.drop('H', axis=0, inplace=True)

In [48]:
df

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119     20.0
B  -0.134841   0.390528   0.166905   0.184502     50.0
C   0.807706   0.072960   0.638787   0.329646     80.0
D  -0.497104  -0.754070  -0.943406   0.484752     90.0
E  -0.116773   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0

## 4) Selecting subset of rows and columns

In [49]:
df.loc['B']['Y']

0.16690463609281317

In [50]:
df.loc['B', 'Y']

0.16690463609281317

In [51]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [52]:
df[['W', 'X']].loc[['A','B']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528

## 5) Selecting by conditions

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [53]:
df

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119     20.0
B  -0.134841   0.390528   0.166905   0.184502     50.0
C   0.807706   0.072960   0.638787   0.329646     80.0
D  -0.497104  -0.754070  -0.943406   0.484752     90.0
E  -0.116773   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0

In [54]:
df > 0

       W      X      Y      Z  my_list
A   True   True  False  False     True
B  False   True   True   True     True
C   True   True   True   True     True
D  False  False  False   True     True
E  False   True   True   True     True
V   True   True   True   True     True

In [55]:
df[df > 0]

           W          X          Y          Z  my_list
A   0.302665   1.693723        NaN        NaN     20.0
B        NaN   0.390528   0.166905   0.184502     50.0
C   0.807706   0.072960   0.638787   0.329646     80.0
D        NaN        NaN        NaN   0.484752     90.0
E        NaN   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0

In [56]:
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
V     True
Name: W, dtype: bool

In [57]:
df[df['W'] > 0]

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119     20.0
C   0.807706   0.072960   0.638787   0.329646     80.0
V  10.000000  20.000000  50.000000  80.000000     90.0

In [58]:
df[df['W'] > 0]['Y']

A    -1.706086
C     0.638787
V    50.000000
Name: Y, dtype: float64

In [59]:
df[df['W'] > 0][['Y','X']]

           Y          X
A  -1.706086   1.693723
C   0.638787   0.072960
V  50.000000  20.000000

In [60]:
df[df['W'] > 0][['Y','X']].loc[['A','V'],['X']]

           X
A   1.693723
V  20.000000

In [61]:
df

           W          X          Y          Z  my_list
A   0.302665   1.693723  -1.706086  -1.159119     20.0
B  -0.134841   0.390528   0.166905   0.184502     50.0
C   0.807706   0.072960   0.638787   0.329646     80.0
D  -0.497104  -0.754070  -0.943406   0.484752     90.0
E  -0.116773   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0

**For two conditions you can use | and & with parenthesis:**

In [62]:
(df['W'] > 0) & (df['Y'] < 1)

A     True
B    False
C     True
D    False
E    False
V    False
dtype: bool

In [63]:
(df['W'] > 0) | (df['Y'] < 1)

A    True
B    True
C    True
D    True
E    True
V    True
dtype: bool

In [64]:
~(df['W'] > 0) & (df['Y'] < 1)

A    False
B     True
C    False
D     True
E     True
V    False
dtype: bool

In [65]:
df[(df['W'] > 0) & (df['Y'] < 1)]

          W         X         Y         Z  my_list
A  0.302665  1.693723 -1.706086 -1.159119     20.0
C  0.807706  0.072960  0.638787  0.329646     80.0

In [66]:
df[(df['W'] < 0) | ~(df['Y'] < 1)]

           W          X          Y          Z  my_list
B  -0.134841   0.390528   0.166905   0.184502     50.0
D  -0.497104  -0.754070  -0.943406   0.484752     90.0
E  -0.116773   1.901755   0.238127   1.996652     70.0
V  10.000000  20.000000  50.000000  80.000000     90.0

**isin**

In [67]:
df['my_list'].isin([20, 70])

A     True
B    False
C    False
D    False
E     True
V    False
Name: my_list, dtype: bool

In [68]:
df[df['my_list'].isin([20, 70])]

          W         X         Y         Z  my_list
A  0.302665  1.693723 -1.706086 -1.159119     20.0
E -0.116773  1.901755  0.238127  1.996652     70.0

# Great Job!